#Написать регулярное выражение, для проверки  правильности введенного ip адреса. Диапазон ip адресов от 0.0.0.0 до 255.255.255.255.
import re
while True:
    ip = input('Введите ip - ')
    if re.match(r'^(25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)\.(25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)\.(25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)\.(25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)$', ip):
        print('ip введен верно!')
    else:
        print('ip введен неверно!')


